# Mullion Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mullion Class
Members See Also
---
Represents a CurtainGrid within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Mullion : FamilyInstance
```

Visual Basic
---
```text
Public Class Mullion _
	Inherits FamilyInstance
```

Visual C++
---
```text
public ref class Mullion : public FamilyInstance
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..FamilyInstance Autodesk.Revit.DB..::..Mullion
# See Also
Mullion Members
Autodesk.Revit.DB Namespace